Reports/СправкаРасчетСебестоимостиПродукцииИУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Report>
		<Properties>
			<Name>СправкаРасчетСебестоимостиПродукцииИУслуг</Name>
			<Comment>(регл)</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНач</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКон</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПостроительОтчета</Name>
					<Type>
						<v8:Type>cfg:ReportBuilder</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОтчета</Name>
					<Comment>1 - БУ, 2 - НУ, 3 - БУ, ПР, ВР</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОперации</Name>
					<Comment>1- продукция и услуги с плановыми ценами, 2 - услуги без плановых цен</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СохраняемыеРеквизиты</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьИнуюНастройку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/РасчетСебестоимостиПродукцици.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>РасчетСебестоимостиПродукцици</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНЗП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНЗПНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПериодРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Продукция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийРасчетаСебестоимости</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыОперацийРасчетаСебестоимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыОперацийРасчетаСебестоимости</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РасходыНаПроизводствоПродукцииИУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УслугиБезИспользованияПлановыхЦен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыпускПродукцииИУслуг</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/СправкаРасчетСебестоимостиПродукцииИУслуг/Ext/ObjectModule.bsl
#Если Клиент Тогда
	
Перем НП Экспорт;
	
Функция СформироватьТекстЗапроса()
		
	Текст = 
	"ВЫБРАТЬ
	|	РасчетСебестоимостиПродукцици.ПериодРасчета КАК ПериодРасчета,
	|	РасчетСебестоимостиПродукцици.СчетУчета КАК СчетУчета,
	|	РасчетСебестоимостиПродукцици.Подразделение КАК Подразделение,
	|	РасчетСебестоимостиПродукцици.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	РасчетСебестоимостиПродукцици.Продукция КАК Продукция,
	|	РасчетСебестоимостиПродукцици.СуммаПлан КАК СуммаПлан,
	|	РасчетСебестоимостиПродукцици.Сумма КАК Сумма,
	|	РасчетСебестоимостиПродукцици.СуммаНУ КАК СуммаНУ,
	|	РасчетСебестоимостиПродукцици.СуммаНЗП КАК СуммаНЗП,
	|	РасчетСебестоимостиПродукцици.СуммаНЗПНУ КАК СуммаНЗПНУ
	|ИЗ
	|	РегистрСведений.РасчетСебестоимостиПродукцици КАК РасчетСебестоимостиПродукцици
	|ГДЕ
	|	РасчетСебестоимостиПродукцици.Активность
	|	И (НЕ РасчетСебестоимостиПродукцици.ВидОперации = &УслугиБезПлановыхЦен)
	|	И РасчетСебестоимостиПродукцици.Организация = &Организация
	|	И РасчетСебестоимостиПродукцици.СчетУчета В ИЕРАРХИИ(&СчетУчета)
	|	И РасчетСебестоимостиПродукцици.ПериодРасчета МЕЖДУ &ДатаНач И &ДатаКон
	|ИТОГИ
	|	МАКСИМУМ(СуммаПлан),
	|	СУММА(Сумма),
	|	СУММА(СуммаНУ),
	|	СУММА(СуммаНЗП),
	|	СУММА(СуммаНЗПНУ)
	|ПО
	|	ПериодРасчета,
	|	СчетУчета,
	|	Подразделение,
	|	НоменклатурнаяГруппа,
	|	Продукция";		  
	
	Возврат Текст;
		
КонецФункции
	
// Выполняет запрос и формирует табличный документ-результат отчета
// в соответствии с настройками, заданными значениями реквизитов отчета.
//
// Параметры:
//	ДокументРезультат - табличный документ, формируемый отчетом
//	ПоказыватьЗаголовок - признак видимости строк с заголовком отчета
//	ВысотаЗаголовка - параметр, через который возвращается высота заголовка в строках 
//
Процедура СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок, ВысотаЗаголовка, ТолькоЗаголовок = Ложь, НачалоПодписи, ПоказыватьПодписи) Экспорт
		
	НачалоПериода = НачалоДня(ДатаНач);
	КонецПериода  = КонецДня(ДатаКон);
	
	ДокументРезультат.Очистить();
	
	ОтчетДо2015 = НачалоПериода < глЗначениеПеременной("ДатаНКУ2015");
	Макет = ?(ОтчетДо2015, ПолучитьМакет("ОтчетДо2015"), ПолучитьМакет("Отчет"));
	
	// 37490 <<
	КодЯзыкаПечать = ЛокализацияПовтИсп.ПолучитьЯзыкФормированияПечатныхФормОтчетов();
	Макет.КодЯзыкаМакета = КодЯзыкаПечать;
	// 37490 >>
	МакетОбщий = ПолучитьОбщийМакет("СправкаРасчет");
	// 37490 <<
	МакетОбщий.КодЯзыкаМакета = КодЯзыкаПечать;
	// 37490 >>
	
	ЗаголовокОтчета = МакетОбщий.ПолучитьОбласть("Заголовок");
	
	
	// Когда нужен только заголовок:
	Если ТолькоЗаголовок Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВысотаЗаголовка) Тогда
		ДокументРезультат.Область("R1:R" + ВысотаЗаголовка).Видимость = ПоказыватьЗаголовок;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНач",     НачалоПериода);
	Запрос.УстановитьПараметр("ДатаКон",     КонецПериода);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("УслугиБезПлановыхЦен",  Перечисления.ВидыОперацийРасчетаСебестоимости.УслугиБезИспользованияПлановыхЦен);
	
	ОграниченияПоПостроителюОтчета = БухгалтерскиеОтчеты.ПолучитьТекстОграниченийПоПостроителюОтчета(ПостроительОтчета, Запрос);
	
	Если Не ПустаяСтрока(ОграниченияПоПостроителюОтчета) Тогда
		
		ОграниченияПоПостроителюОтчета = " И " + ОграниченияПоПостроителюОтчета;
		ОграниченияПоПостроителюОтчета = СтрЗаменить(ОграниченияПоПостроителюОтчета, "Субконто1", "Подразделение");
		ОграниченияПоПостроителюОтчета = СтрЗаменить(ОграниченияПоПостроителюОтчета, "Субконто2", "НоменклатурнаяГруппа");
		
	КонецЕсли;
	
	Запрос.Текст = СформироватьТекстЗапроса();
	
	Запрос.Текст  = СтрЗаменить(Запрос.Текст, "Активность","Активность " + ОграниченияПоПостроителюОтчета);
	
	
	Счета = Новый Массив;
	Счета.Добавить(ПланыСчетов.Хозрасчетный.ОсновноеПроизводство);
	Счета.Добавить(ПланыСчетов.Хозрасчетный.ВспомогательныеПроизводства);
	Запрос.УстановитьПараметр("СчетУчета",    Счета);
	
	
	Если ВариантОперации = 2 Тогда
		Запрос.Текст  = СтрЗаменить(Запрос.Текст, "НЕ РасчетСебестоимостиПродукцици.ВидОперации", "РасчетСебестоимостиПродукцици.ВидОперации");
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	
	ОбластьШапка            = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапкаУслуги      = Макет.ПолучитьОбласть("ШапкаУслуги");
	ОбластьСтрока           = Макет.ПолучитьОбласть("Строка");
	ОбластьСтрокаУслуги     = Макет.ПолучитьОбласть("СтрокаУслуги");
	ОбластьПодСтрока        = Макет.ПолучитьОбласть("ПодСтрока");
	ОбластьИтого            = Макет.ПолучитьОбласть("Итого");
	ОбластьВсего            = Макет.ПолучитьОбласть("Всего");
	ОбластьВсегоУслуги      = Макет.ПолучитьОбласть("ВсегоУслуги");
	ОбластьОкончаниеТаблицы = Макет.ПолучитьОбласть("ОкончаниеТаблицы");
	ОбластьОкончаниеТаблицыУслуги = Макет.ПолучитьОбласть("ОкончаниеТаблицыУслуги");
	ОбластьПодвал           = МакетОбщий.ПолучитьОбласть("Подвал");
	
	ВыборкаПериод = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Всего = 0;
	ВсегоПериодБаза = 0;
	Пока ВыборкаПериод.Следующий() Цикл
		
		ЗаголовокОтчета.Параметры.Период              = "" + ПредставлениеПериода(НачалоМесяца(ВыборкаПериод.ПериодРасчета), КонецМесяца(ВыборкаПериод.ПериодРасчета), "Л="+Локализация.ОпределитьКодЯзыкаДляФормат(Локализация.КодЯзыкаИнтерфейса())+"; ФП = Истина");
		ЗаголовокОтчета.Параметры.НазваниеОрганизации = "" + Организация.НаименованиеПолное;
		ЗаголовокОтчета.Параметры.ДатаСоставления     = КонецМесяца(ВыборкаПериод.ПериодРасчета);
		ЗаголовокОтчета.Параметры.НазваниеОтчета      = НСтр("ru='Себестоимость ';uk='Собівартість '", КодЯзыкаПечать) + ?(ВариантОперации = 1, НСтр("ru='выпущенной продукции и ';uk='випущеної продукції й '", КодЯзыкаПечать), "") + НСтр("ru='оказанных услуг производственного характера, по которым ';uk='зроблених послуг виробничого характеру, по яких '", КодЯзыкаПечать) + ?(ВариантОперации = 2, НСтр("ru='не';uk='не'", КодЯзыкаПечать), "") + НСтр("ru=' предусмотрены плановые цены (бухгалтерский учет)';uk=' передбачено планові ціни (бухгалтерський облік)'", КодЯзыкаПечать);
		ДокументРезультат.Вывести(ЗаголовокОтчета);
		
		СтрОтбор = УправлениеОтчетами.СформироватьСтрокуОтборов(ПостроительОтчета.Отбор);
		Если Не ПустаяСтрока(СтрОтбор) Тогда
			ОбластьОтбор = МакетОбщий.ПолучитьОбласть("СтрокаОтбор");
			ОбластьОтбор.Параметры.ТекстПроОтбор = НСтр("ru='Отбор: ';uk='Відбір: '", КодЯзыкаПечать) + СтрОтбор;
			ДокументРезультат.Вывести(ОбластьОтбор);
		КонецЕсли;
		
		// Параметр для показа заголовка
		ВысотаЗаголовка = ДокументРезультат.ВысотаТаблицы;
		
		ОбластьШапка.Параметры.ТекстРасходов       = НСтр("ru='Прямые расходы';uk='Прямі витрати'", КодЯзыкаПечать);
		ОбластьШапка.Параметры.ТекстСебестоимости  = НСтр("ru='Сумма прямых расходов, приходящаяся на выпуск';uk='Сума прямих витрат, що доводиться на випуск'", КодЯзыкаПечать);
		ДокументРезультат.Вывести(?(ВариантОперации = 2, ОбластьШапкаУслуги, ОбластьШапка));
		
		
		ВыборкаСчет = ВыборкаПериод.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаСчет.Следующий() Цикл
			ВыборкаПодразделение = ВыборкаСчет.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаПодразделение.Следующий() Цикл
				ВыборкаНомГруппа = ВыборкаПодразделение.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаНомГруппа.Следующий() Цикл
					ПерваяСтрока = Истина;
					ПоказыватьСтрокуИтого = Истина; 
					Выборка = ВыборкаНомГруппа.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					ВсегоБаза = 0;
					ВсегоСумма = 0;
					ВсегоСуммаНУ = 0;
					Пока Выборка.Следующий() Цикл
						ВсегоБаза  = ВсегоБаза + Выборка.СуммаПлан;
						ВсегоСумма = ВсегоСумма + Выборка.СуммаПлан + Выборка.Сумма;
						ВсегоСуммаНУ = ВсегоСуммаНУ + Выборка.СуммаПлан + Выборка.СуммаНУ;
					КонецЦикла;
					Если ВариантОперации = 1 Тогда
						Выборка = ВыборкаНомГруппа.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						
						Пока Выборка.Следующий() Цикл
							
							Если Выборка.Сумма = 0 И Выборка.СуммаНУ = 0 И Выборка.СуммаПлан = 0 Тогда	
								Продолжить;
							КонецЕсли;
							
							Если ПерваяСтрока Тогда
								Область = ОбластьСтрока;
								Область.Параметры.СчетЗатрат           = ВыборкаНомГруппа.СчетУчета;
								Область.Параметры.Подразделение        = ВыборкаНомГруппа.Подразделение;
								Область.Параметры.НоменклатурнаяГруппа = ВыборкаНомГруппа.НоменклатурнаяГруппа;
								Область.Параметры.СуммаРасходовБезНЗП  = ВсегоСумма;
								Область.Параметры.СуммаНЗП             = ВыборкаНомГруппа.СуммаНЗП;
								Область.Параметры.СуммаРасходов        = ВсегоСумма + ВыборкаНомГруппа.СуммаНЗП;
								Если ОтчетДо2015 Тогда 
									Область.Параметры.СуммаРасходовБезНЗПНУ = ВсегоСуммаНУ;
									Область.Параметры.СуммаНЗПНУ            = ВыборкаНомГруппа.СуммаНЗПНУ;
									Область.Параметры.СуммаРасходовНУ       = ВсегоСуммаНУ + ВыборкаНомГруппа.СуммаНЗПНУ;
								КонецЕсли;
							Иначе
								Область =  ОбластьПодСтрока;
							КонецЕсли;
							
							
							Область.Параметры.Продукция            = УправлениеПроизводством.ВыводНаименованияВыпуска(Выборка.Продукция, Ложь);
							Область.Параметры.Коэффициент          = ?(ВсегоБаза = 0, 0, Выборка.СуммаПлан / ВсегоБаза);
							Область.Параметры.СуммаБазы            = Выборка.СуммаПлан;
							Область.Параметры.СуммаОтклонения      = Выборка.Сумма;
							Область.Параметры.Сумма                = Выборка.Сумма + Выборка.СуммаПлан;
							Если ОтчетДо2015 Тогда
								Область.Параметры.СуммаОтклоненияНУ    = Выборка.СуммаНУ;
								Область.Параметры.СуммаНУ              = Выборка.СуммаНУ + Выборка.СуммаПлан;	
							КонецЕсли; 
							ПоказыватьСтрокуИтого                  = Не (Выборка.СуммаПлан = ВсегоБаза); 
							ВсегоПериодБаза = ВсегоПериодБаза +  Выборка.СуммаПлан;
							ДокументРезультат.Вывести(Область);
							
							ПерваяСтрока = Ложь;
						КонецЦикла;  	
					Иначе
						
						Если Выборка.Сумма = 0 Тогда
							Продолжить;
						КонецЕсли;
						
						Область = ОбластьСтрокаУслуги;
						Область.Параметры.СчетЗатрат           = ВыборкаНомГруппа.СчетУчета;
						Область.Параметры.Подразделение        = ВыборкаНомГруппа.Подразделение;
						Область.Параметры.НоменклатурнаяГруппа = ВыборкаНомГруппа.НоменклатурнаяГруппа;
						Область.Параметры.СуммаРасходовБезНЗП  = ВыборкаНомГруппа.Сумма + ВыборкаНомГруппа.СуммаПлан;
						Область.Параметры.СуммаНЗП             = ВыборкаНомГруппа.СуммаНЗП;
						Область.Параметры.СуммаРасходов        = ВыборкаНомГруппа.Сумма + ВыборкаНомГруппа.СуммаПлан + ВыборкаНомГруппа.СуммаНЗП;
						Если ОтчетДо2015 Тогда
							Область.Параметры.СуммаРасходовБезНЗПНУ= ВыборкаНомГруппа.СуммаНУ + ВыборкаНомГруппа.СуммаПлан;
							Область.Параметры.СуммаНЗПНУ           = ВыборкаНомГруппа.СуммаНЗПНУ;
							Область.Параметры.СуммаРасходовНУ      = ВыборкаНомГруппа.СуммаНУ + ВыборкаНомГруппа.СуммаПлан + ВыборкаНомГруппа.СуммаНЗПНУ;
						КонецЕсли; 
						
						ВсегоПериодБаза = ВсегоПериодБаза +  ВыборкаНомГруппа.СуммаПлан;
						ПоказыватьСтрокуИтого                      = Ложь; 
						
						ДокументРезультат.Вывести(Область);
						
						
					КонецЕсли;
					
					
					Если ПоказыватьСтрокуИтого Тогда
						ОбластьИтого.Параметры.Сумма           = ВсегоСумма;
						ОбластьИтого.Параметры.СуммаБазы       = ВсегоБаза;
						ОбластьИтого.Параметры.СуммаОтклонения = ВсегоСумма - ВсегоБаза;
						Если ОтчетДо2015 Тогда
							ОбластьИтого.Параметры.СуммаНУ         	 = ВсегоСуммаНУ;
							ОбластьИтого.Параметры.СуммаОтклоненияНУ = ВсегоСуммаНУ - ВсегоБаза;
						КонецЕсли; 
						
						ДокументРезультат.Вывести(ОбластьИтого);
						
					КонецЕсли;
					
				КонецЦикла;  // НомГруппа
			КонецЦикла;  //  Подразделение
		КонецЦикла;  //  СчетУчета
		
		Область        = ?(ВариантОперации = 1, ОбластьВсего, ОбластьВсегоУслуги);
		
		Область.Параметры.СуммаРасходовБезНЗП  = ВыборкаПериод.Сумма + ВсегоПериодБаза;
		Область.Параметры.СуммаНЗП             = ВыборкаПериод.СуммаНЗП;
		Область.Параметры.СуммаРасходов        = ВыборкаПериод.Сумма + ВсегоПериодБаза + ВыборкаПериод.СуммаНЗП;
		Если ОтчетДо2015 Тогда
			Область.Параметры.СуммаРасходовБезНЗПНУ= ВыборкаПериод.СуммаНУ + ВсегоПериодБаза;
			Область.Параметры.СуммаНЗПНУ           = ВыборкаПериод.СуммаНЗПНУ;
			Область.Параметры.СуммаРасходовНУ      = ВыборкаПериод.СуммаНУ + ВсегоПериодБаза + ВыборкаПериод.СуммаНЗПНУ;
		КонецЕсли; 
		
		Если ВариантОперации = 1 Тогда
			Область.Параметры.Сумма                = ВыборкаПериод.Сумма + ВсегоПериодБаза;
			Область.Параметры.СуммаБазы            = ВсегоПериодБаза;
			Область.Параметры.СуммаОтклонения      = Область.Параметры.Сумма - Область.Параметры.СуммаБазы;
			Если ОтчетДо2015 Тогда
				Область.Параметры.СуммаНУ           = ВыборкаПериод.СуммаНУ + ВсегоПериодБаза;
				Область.Параметры.СуммаОтклоненияНУ = Область.Параметры.СуммаНУ - Область.Параметры.СуммаБазы;
			КонецЕсли; 
			
		КонецЕсли;
		ДокументРезультат.Вывести(Область);
		ДокументРезультат.Вывести(?(ВариантОперации = 1, ОбластьОкончаниеТаблицы, ОбластьОкончаниеТаблицыУслуги));
		
		ОбластьПодвал.Параметры.ТекстПримечания = "";
		ДокументРезультат.Вывести(ОбластьПодвал);
		
		ВысотаПодписи = ДокументРезультат.Области.Подвал.Низ - ДокументРезультат.Области.Подвал.Верх;
		
		ДокументРезультат.Области.Подвал.Видимость = ПоказыватьПодписи;
		
	КонецЦикла;    // Период	
	
	// Зафиксируем заголовок отчета
	ДокументРезультат.ФиксацияСверху = 10;
	
	// Первую колонку не печатаем
	ДокументРезультат.ОбластьПечати = ДокументРезультат.Область(1,2,ДокументРезультат.ВысотаТаблицы,ДокументРезультат.ШиринаТаблицы);
	
	// Присвоим имя для сохранения параметров печати табличного документа
	ДокументРезультат.ИмяПараметровПечати = НСтр("ru='Расчет себестоимости продукции';uk='Розрахунок собівартості продукції'", КодЯзыкаПечать);
	
	УправлениеОтчетами.УстановитьКолонтитулыПоУмолчанию(ДокументРезультат, ЗаголовокОтчета, Строка(глЗначениеПеременной("глТекущийПользователь")));
		
КонецПроцедуры // СформироватьОтчет
	
	
////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ
// 
	
НП = Новый НастройкаПериода;
	
#КонецЕсли
